name: "BilinearRegressionNet"
layer{
    name: "data"
    type: "HDF5Data"
    top: "image_curr"
    top: "vel"
    top: "image_diff"
    hdf5_data_param{
        source: "data/squares_train_data.txt"
        batch_size: 100
        shuffle: true
    }
    include{
        phase: TRAIN
    }
}
layer{
    name: "data"
    type: "HDF5Data"
    top: "image_curr"
    top: "vel"
    top: "image_diff"
    hdf5_data_param{
        source: "data/squares_test_data.txt"
        batch_size: 100
    }
    include{
        phase: TEST
    }
}
layer {
  name: "flatten1"
  type: "Flatten"
  bottom: "image_curr"
  top: "y"
}
layer {
  name: "flatten2"
  type: "Flatten"
  bottom: "image_diff"
  top: "y_diff"
}
layer {
  name: "fc1"
  type: "InnerProduct"
  bottom: "y"
  top: "fc1_y"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  inner_product_param {
    num_output: 70
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fc2"
  type: "InnerProduct"
  bottom: "vel"
  top: "fc2_u"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  inner_product_param {
    num_output: 70
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fc3"
  type: "InnerProduct"
  bottom: "vel"
  top: "fc3_u"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  inner_product_param {
    num_output: 70
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "prod"
  type: "Eltwise"
  bottom: "fc1_y"
  bottom: "fc2_u"
  top: "prod_y_u"
  eltwise_param { operation: PROD }
}
layer {
  name: "sum"
  type: "Eltwise"
  bottom: "prod_y_u"
  bottom: "fc3_u"
  top: "y_diff_pred"
  eltwise_param { operation: SUM }
}
layer{
    name: "loss"
    type: "EuclideanLoss"
    bottom: "y_diff_pred"
    bottom: "y_diff"
    top: "loss"
}